---
kind: type
id: T:Autodesk.Revit.DB.ViewDisplayEdges
source: html/3e28283d-701e-4b00-5bab-0d1da2e8bb86.htm
---
# Autodesk.Revit.DB.ViewDisplayEdges

A collection of settings defining how visible edges are displayed

## Syntax (C#)
```csharp
public enum ViewDisplayEdges
```